/**
 * @Description: 语言配置
 * @Author: Auspicious
 * @Email: <18437980785@163.com>
 * @Date: 2020/6/10 16:12
 * @LastEditors: missagril
 */

const config: any = {
    zh: {
        101: "查看当前版本号",
        102: "获取我的云链列表",
        103: "配置您的 APP_ID、APP_SECRET 以及可选项的 APP_HOST",
        104: "获取我的合约列表",
        105: "写入数据到指定合约的函数",

        200: "云链ID",
        201: "云链名称",

        202: "合约ID",
        203: "合约的链ID",
        204: "合约备注｜名称",
        205: "合约账户",

        300: "网络状态码",
        301: "接口状态码",
        302: "提示信息",
        303: '数据',
        304: '系统备注',
        1001: "请执行 config 命令配置您的APP_ID 和 APP_SECRET",
        1002: "发生了一些意料之外的错误：[%s]",
        1003: "请输入您的 APP_ID",
        1004: "请输入您的 APP_SECRET",
        1005: "Success：写入配置成功",
        1006: `参数[chainData]不是标准的JSON格式，示例：'{"name": "auspicious"}'`,
        1007: "请输入要写入数据的链的ID",
        1008: "请输入要写入数据的合约的ID",
        1009: "请输入要写入数据的的账户名称",
        1010: "请输入要写入数据的函数名称",
        1011: "请输入要写入的数据",
        1012: '参数 [APP_ID] 未设置 ',
        1013: '参数 [APP_SECRET] 未设置',
        1014: "请求失败",
        1015: "请求成功",
        1016: '\n点击链接查看交易详情：\n%s\n',
        1017: '参数[APP_HOST] 必须使用 http:// 或者 https:// 开头',
        1018: '语言参数只支持配置：\'ZH\', \'EN\', \'zh\', \'en\'',
        1019: '您必须使用 `new` 关键字声明引用实例'
    },
    en: {}
};

export default config["zh"];
